## Staging: cognito
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 0 to change, 4 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cognito_user_pool.forms must be replaced
-/+ resource "aws_cognito_user_pool" "forms" {
      ~ arn                        = "arn:aws:cognito-idp:ca-central-1:687401027353:userpool/ca-central-1_Oimm2vbOL" -> (known after apply)
      ~ auto_verified_attributes   = [
          + "email",
        ]
      ~ creation_date              = "2022-09-13T16:52:48Z" -> (known after apply)
      + custom_domain              = (known after apply)
      ~ domain                     = "forms" -> (known after apply)
      ~ email_verification_message = "Your verification code is {####}. " -> (known after apply)
      ~ email_verification_subject = "Your verification code" -> (known after apply)
      ~ endpoint                   = "cognito-idp.ca-central-1.amazonaws.com/ca-central-1_Oimm2vbOL" -> (known after apply)
      ~ estimated_number_of_users  = 3 -> (known after apply)
      ~ id                         = "ca-central-1_Oimm2vbOL" -> (known after apply)
      ~ last_modified_date         = "2022-09-21T19:32:15Z" -> (known after apply)
        name                       = "forms_user_pool"
      ~ sms_verification_message   = "Your verification code is {####}. " -> (known after apply)
      - tags                       = {} -> null
      ~ tags_all                   = {} -> (known after apply)
      + username_attributes        = [
          + "email",
        ] # forces replacement
        # (1 unchanged attribute hidden)


      ~ admin_create_user_config {
          ~ allow_admin_create_user_only = true -> false

            # (1 unchanged block hidden)
        }

      ~ email_configuration {
            # (1 unchanged attribute hidden)
        }

      ~ password_policy {
          - temporary_password_validity_days = 7 -> null
            # (5 unchanged attributes hidden)
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      - username_configuration {
          - case_sensitive = true -> null # forces replacement
        }

      ~ verification_message_template {
          ~ email_message         = "Your verification code is {####}. " -> (known after apply)
          ~ email_message_by_link = "Please click the link below to verify your email address. {##Verify Email##} " -> "Please confirm your email / S.V.P confirmer votre email {##Click Here##}"
          ~ email_subject         = "Your verification code" -> (known after apply)
          ~ email_subject_by_link = "Your verification link" -> "Please confirm your email for GC Forms / S.V.P confirmer votre email pour GC Formulaire  "
          ~ sms_message           = "Your verification code is {####}. " -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # aws_cognito_user_pool_client.forms must be replaced
-/+ resource "aws_cognito_user_pool_client" "forms" {
      - access_token_validity                = 0 -> null
      ~ client_secret                        = (sensitive value)
      ~ enable_token_revocation              = true -> (known after apply)
      ~ explicit_auth_flows                  = [
          + "ALLOW_ADMIN_USER_PASSWORD_AUTH",
        ]
      ~ id                                   = "3145gkeetee51d4dh2k2kekrd7" -> (known after apply)
      - id_token_validity                    = 0 -> null
      ~ logout_urls                          = [] -> (known after apply)
        name                                 = "forms_client"
      + prevent_user_existence_errors        = (known after apply)
      - read_attributes                      = [] -> null
      ~ user_pool_id                         = "ca-central-1_Oimm2vbOL" -> (known after apply) # forces replacement
      - write_attributes                     = [] -> null
        # (7 unchanged attributes hidden)
    }

  # aws_cognito_user_pool_domain.forms must be replaced
-/+ resource "aws_cognito_user_pool_domain" "forms" {
      ~ aws_account_id              = "687401027353" -> (known after apply)
      ~ cloudfront_distribution_arn = "dq9dozspu8y40.cloudfront.net" -> (known after apply)
      ~ id                          = "forms" -> (known after apply)
      ~ s3_bucket                   = "aws-cognito-prod-yul-assets" -> (known after apply)
      ~ user_pool_id                = "ca-central-1_Oimm2vbOL" -> (known after apply) # forces replacement
      ~ version                     = "20220921193215" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.cognito_client_secret must be replaced
-/+ resource "aws_secretsmanager_secret_version" "cognito_client_secret" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:cognito_client_secret-ZjdUZU" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:cognito_client_secret-ZjdUZU|B3268909-6129-47CA-859F-777A508DAB7F" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "B3268909-6129-47CA-859F-777A508DAB7F" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ cognito_client_id         = "3145gkeetee51d4dh2k2kekrd7" -> (known after apply)
  ~ cognito_client_secret_arn = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:cognito_client_secret-ZjdUZU" -> (known after apply)
  ~ cognito_endpoint_url      = "cognito-idp.ca-central-1.amazonaws.com/ca-central-1_Oimm2vbOL" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cognito_user_pool.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.cognito_client_secret"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
